Конфигурация/DataProcessors/ФормированиеБухгалтерскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеБухгалтерскогоУчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/СтоимостьПереоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьПереоценки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаСоЗнаком</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупонаВВалютеУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиЦеныДляПереоценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКотировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаСоЗнаком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКотировкиКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировкиКупона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Например, дефолт</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыНоминала</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЦеныКупона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенОценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыЗапретаРедактирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОтложенныеЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтложенныеЗадания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОтложенныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерезапускатьПоИстечениюТаймаута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапускаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибкиОтмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивныйЗапуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ГруппыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ГруппыЗапретаРедактирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БэкОфис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Партии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проводки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияОтложенныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияОтложенныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ФормированиеБухгалтерскогоУчета/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(ПерезаполнятьСчетаУчета = Истина);
	
	Если ЭтаФорма.СчетаДоверительногоУправления.Количество() > 0 И ПерезаполнятьСчетаУчета Тогда
		ЭтаФорма.СчетаДоверительногоУправления.Очистить();
	КонецЕсли;
	
	Если НЕ (ЭтаФорма.ФормироватьБухгалтерскийУчет ИЛИ ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет ИЛИ ЭтаФорма.ФормироватьНалоговыйУчет) Тогда
	    Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ЗапросСчетаДУ = Новый Запрос;
	ЗапросСчетаДУ.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросСчетаДУ.УстановитьПараметр("ИсключатьЗакрытыеДоговоры",		ЭтотОбъект.ИсключатьЗакрытыеДоговоры);
	ЗапросСчетаДУ.УстановитьПараметр("ТолькоЗакрытыеДоговоры",			ЭтотОбъект.ТолькоЗакрытыеДоговоры);
	ЗапросСчетаДУ.УстановитьПараметр("Период",							Объект.НачалоПериода);
	ЗапросСчетаДУ.УстановитьПараметр("Организация",						Объект.Организация);
	
	Если НЕ ПерезаполнятьСчетаУчета Тогда
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка В(&СчетаДоверительногоУправления)
		|	И СчетаДоверительногоУправления.Организация = &Организация";
	
		ЗапросСчетаДУ.УстановитьПараметр("СчетаДоверительногоУправления",	ЭтаФорма.СчетаДоверительногоУправления.Выгрузить(, "СчетДоверительногоУправления").ВыгрузитьКолонку("СчетДоверительногоУправления"));
	
	ИначеЕсли ЭтаФорма.РежимОтбора = 0 Тогда // все счета ДУ
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (&ИсключатьЗакрытыеДоговоры
		|				И (СчетаДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИЛИ НЕ &ИсключатьЗакрытыеДоговоры
		|				И НЕ &ТолькоЗакрытыеДоговоры
		|			ИЛИ &ТолькоЗакрытыеДоговоры
		|				И СчетаДоверительногоУправления.ДатаРасторжения < &Период
		|				И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 1 Тогда // по виду договора ДУ
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (&ИсключатьЗакрытыеДоговоры
		|				И (СчетаДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИЛИ НЕ &ИсключатьЗакрытыеДоговоры
		|				И НЕ &ТолькоЗакрытыеДоговоры
		|			ИЛИ &ТолькоЗакрытыеДоговоры
		|				И СчетаДоверительногоУправления.ДатаРасторжения < &Период
		|				И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления В(&ОтборВидыДоговоровДУ)";
		
		ЗапросСчетаДУ.УстановитьПараметр("ОтборВидыДоговоровДУ",	ЭтаФорма.ОтборВидыДоговоровДУ.ВыгрузитьЗначения());
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 Тогда // по счету ДУ
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И  (&ИсключатьЗакрытыеДоговоры
		|				И (СчетаДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИЛИ НЕ &ИсключатьЗакрытыеДоговоры
		|				И НЕ &ТолькоЗакрытыеДоговоры
		|			ИЛИ &ТолькоЗакрытыеДоговоры
		|				И СчетаДоверительногоУправления.ДатаРасторжения < &Период
		|				И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И СчетаДоверительногоУправления.Ссылка В(&ОтборСчетаДУ)";
		
		ЗапросСчетаДУ.УстановитьПараметр("ОтборСчетаДУ",	ЭтаФорма.ОтборСчетаДУ.ВыгрузитьЗначения());
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 3 Тогда // по клиенту ДУ
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Клиент В (&ОтборКлиенты)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И  (&ИсключатьЗакрытыеДоговоры
		|				И (СчетаДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИЛИ НЕ &ИсключатьЗакрытыеДоговоры
		|				И НЕ &ТолькоЗакрытыеДоговоры
		|			ИЛИ &ТолькоЗакрытыеДоговоры
		|				И СчетаДоверительногоУправления.ДатаРасторжения < &Период
		|				И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
		
		ЗапросСчетаДУ.УстановитьПараметр("ОтборКлиенты",	ЭтаФорма.ОтборКлиенты.ВыгрузитьЗначения());
		
	ИначеЕсли ЭтаФорма.РежимОтбора = 4 Тогда // по СпецДепу
		
		ЗапросСчетаДУ.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _СчетаДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И  (&ИсключатьЗакрытыеДоговоры
		|				И (СчетаДоверительногоУправления.ДатаРасторжения >= &Период
		|					ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|			ИЛИ НЕ &ИсключатьЗакрытыеДоговоры
		|				И НЕ &ТолькоЗакрытыеДоговоры
		|			ИЛИ &ТолькоЗакрытыеДоговоры
		|				И СчетаДоверительногоУправления.ДатаРасторжения < &Период
		|				И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И СчетаДоверительногоУправления.СпециализированныйДепозитарий В(&ОтборСпецДеп)";
		
		ЗапросСчетаДУ.УстановитьПараметр("ОтборСпецДеп",	ЭтаФорма.ОтборСпецДеп.ВыгрузитьЗначения());
		
	КонецЕсли;
	
	ЗапросСчетаДУ.Выполнить();
	
	
	Запрос = Новый Запрос;
	
	ОтборПоВидамУчета = "";
	
	Если ЭтаФорма.ФормироватьБухгалтерскийУчет Тогда
		Запрос.УстановитьПараметр("БухгалтерскийУчет", Истина);
		ОтборПоВидамУчета = ?(ОтборПоВидамУчета = "", " (&", ОтборПоВидамУчета + " ИЛИ &") + "БухгалтерскийУчет И ВестиБухгалтерскийУчет";
	КонецЕсли;
	
	Если ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет Тогда
		Запрос.УстановитьПараметр("ЕдиныйБухгалтерскийУчет", Истина);
		ОтборПоВидамУчета = ?(ОтборПоВидамУчета = "", " (&", ОтборПоВидамУчета + " ИЛИ &") + "ЕдиныйБухгалтерскийУчет И ВестиЕдиныйБухгалтерскийУчет";
	КонецЕсли;
	
	Если ЭтаФорма.ФормироватьНалоговыйУчет Тогда
		Запрос.УстановитьПараметр("НалоговыйУчет", Истина);
		ОтборПоВидамУчета = ?(ОтборПоВидамУчета = "", " (&", ОтборПоВидамУчета + " ИЛИ &") + "НалоговыйУчет И ВестиНалоговыйУчет";
	КонецЕсли;
	
	ОтборПоВидамУчета = ОтборПоВидамУчета + ")";
	
	Запрос.УстановитьПараметр("Организация",					Объект.Организация);
	Запрос.УстановитьПараметр("Период",							Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",					КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("НачалоПереоценок",				ДобавитьМесяц(Объект.НачалоПериода, -1));
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПереоценкаЦенныхБумаг.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	МАКСИМУМ(ПереоценкаЦенныхБумаг.Дата) КАК Дата
	|ПОМЕСТИТЬ _ПереоценкаПД
	|ИЗ
	|	Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
	|ГДЕ
	|	ПереоценкаЦенныхБумаг.Дата МЕЖДУ &НачалоПереоценок И &Период
	|	И ПереоценкаЦенныхБумаг.Проведен
	|	И ПереоценкаЦенныхБумаг.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПереоценкаЦенныхБумаг.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ПереоценкаПД.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	_ПереоценкаПД.Дата КАК Дата,
	|	ПереоценкаЦенныхБумаг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ _Переоценки
	|ИЗ
	|	_ПереоценкаПД КАК _ПереоценкаПД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаЦенныхБумаг КАК ПереоценкаЦенныхБумаг
	|		ПО _ПереоценкаПД.СчетДоверительногоУправления = ПереоценкаЦенныхБумаг.СчетДоверительногоУправления
	|			И _ПереоценкаПД.Дата = ПереоценкаЦенныхБумаг.Дата
	|			И (ПереоценкаЦенныхБумаг.Проведен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Переоценки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КОЛИЧЕСТВО(СтоимостьПереоценки.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ _Объем
	|ИЗ
	|	_Переоценки КАК _Переоценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|		ПО _Переоценки.Ссылка = СтоимостьПереоценки.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	_Переоценки.СчетДоверительногоУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК Обрабатывать,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиБухгалтерскийУчет КАК БухгалтерскийУчет,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиЕдиныйБухгалтерскийУчет КАК ЕдиныйБухгалтерскийУчет,
	|	НастройкиУчетаОбщиеСрезПоследних.ВестиНалоговыйУчет КАК НалоговыйУчет,
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.КодСчета КАК КодСчетаДУ,
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.Код КАК Код,
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговора,
	|	ДЗ_БУ.ДатаЗапретаРедактирования КАК БухгалтерскийУчетДата,
	|	ДЗ_НУ.ДатаЗапретаРедактирования КАК НалоговыйУчетДата,
	|	ДЗ_ЕПС.ДатаЗапретаРедактирования КАК ЕдиныйБухгалтерскийУчетДата,
	|	ЕСТЬNULL(_Объем.НомерСтроки, 0) КАК ОбъемПортфеля
	|ИЗ
	|	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления В
	|					(ВЫБРАТЬ
	|						_СчетаДУ.Ссылка
	|					ИЗ
	|						_СчетаДУ)) КАК НастройкиУчетаОбщиеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДЗ_БУ
	|		ПО НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления = ДЗ_БУ.СчетДоверительногоУправления
	|			И (ДЗ_БУ.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии))
	|			И (ДЗ_БУ.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.БухгалтерскийУчет))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДЗ_НУ
	|		ПО НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления = ДЗ_НУ.СчетДоверительногоУправления
	|			И (ДЗ_НУ.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии))
	|			И (ДЗ_НУ.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДЗ_ЕПС
	|		ПО НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления = ДЗ_ЕПС.СчетДоверительногоУправления
	|			И (ДЗ_ЕПС.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии))
	|			И (ДЗ_ЕПС.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
	|		ЛЕВОЕ СОЕДИНЕНИЕ _Объем КАК _Объем
	|		ПО НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления = _Объем.СчетДоверительногоУправления
	|ГДЕ
	|	&ОтборПоВидамУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиУчетаОбщиеСрезПоследних.СчетДоверительногоУправления.Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоВидамУчета", ОтборПоВидамУчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(Выборка.СчетДоверительногоУправления) <> Выборка.СчетДоверительногоУправления Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ПерезаполнятьСчетаУчета Тогда
			НоваяСтрока = ЭтаФорма.СчетаДоверительногоУправления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Иначе
			// Устанавливаем флажки только по списку
			НайдСтроки = ЭтаФорма.СчетаДоверительногоУправления.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", Выборка.СчетДоверительногоУправления));
			Если НайдСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайдСтрока = НайдСтроки[0];
			ЗаполнитьЗначенияСвойств(НайдСтрока, Выборка,, "СчетДоверительногоУправления, КодСчетаДУ, ДатаРасторжения, ВидДоговора");
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаданияНаСервере()

	ПараметрыФормированияБухгалтерскогоУчета = Обработки.МенеджерОтложенныхЗаданий.ПолучитьПараметрыФормированияБухгалтерскогоУчета();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Идентификатор КАК Идентификатор,
		|	ОтложенныеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания,
		|	ОтложенныеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОтложенныеЗадания.ВидУчета КАК ВидУчета,
		|	ОтложенныеЗадания.Сложность КАК Сложность,
		|	ОтложенныеЗадания.Пользователь КАК Пользователь,
		|	ОтложенныеЗадания.ДатаДобавления КАК ДатаДобавления,
		|	ОтложенныеЗадания.ДатаЗапуска КАК ДатаЗапуска,
		|	ОтложенныеЗадания.Организация КАК Организация,
		|	ОтложенныеЗадания.Состояние КАК Состояние,
		|	ОтложенныеЗадания.Параметры КАК Параметры,
		|	ВЫБОР
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание)
		|			ТОГДА 1
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется)
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ПорядокЗаданий,
		|	ВЫБОР
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание)
		|			ТОГДА ОтложенныеЗадания.ДатаДобавления
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется)
		|			ТОГДА ОтложенныеЗадания.ДатаЗапуска
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Отменено)
		|			ТОГДА ОтложенныеЗадания.ДатаОшибкиОтмены
		|		ИНАЧЕ ОтложенныеЗадания.ДатаВыполнения
		|	КОНЕЦ КАК ПорядокДат,
		|	ВЫБОР
		|		КОГДА ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Отменено)
		|			ТОГДА ОтложенныеЗадания.ДатаОшибкиОтмены
		|		ИНАЧЕ ОтложенныеЗадания.ДатаВыполнения
		|	КОНЕЦ КАК ДатаЗавершения,
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|		ПО ОтложенныеЗадания.Организация = ДатыЗапретаРедактирования.Организация
		|			И ОтложенныеЗадания.СчетДоверительногоУправления = ДатыЗапретаРедактирования.СчетДоверительногоУправления
		|			И ОтложенныеЗадания.ВидУчета = ДатыЗапретаРедактирования.ВидУчета
		|			И (ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии))
		|ГДЕ
		|	ОтложенныеЗадания.Объект = &Объект
		|	И (НАЧАЛОПЕРИОДА(ОтложенныеЗадания.ДатаДобавления, ДЕНЬ) = &ТекущаяДата
		|			ИЛИ ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание)
		|			ИЛИ ОтложенныеЗадания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется))
		|	И ОтложенныеЗадания.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокЗаданий,
		|	ПорядокДат УБЫВ";
	
	Запрос.УстановитьПараметр("Объект",			ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета);
	Запрос.УстановитьПараметр("ТекущаяДата",	НачалоДня(ТекущаяДата()));
	
	Если РольДоступна("ПолныеПрава") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОтложенныеЗадания.Организация = &Организация", "");
	Иначе		
		Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	КонецЕсли;
	
	ЭтаФорма.Задания.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЕстьВыполняющиеся = Ложь;
	ЕстьОжидающие = Ложь;
	Для каждого СтрокаЗадания Из ЭтаФорма.Задания Цикл
		Если СтрокаЗадания.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Ожидание ИЛИ СтрокаЗадания.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Выполняется Тогда
			ПараметрыФормирования = СтрокаЗадания.Параметры.Получить();
			СтрокаЗадания.Период = ПредставлениеПериода(ПараметрыФормирования.НачалоПериода, ПараметрыФормирования.КонецПериода);
		Иначе
			СтрокаЗадания.Период = "";
		КонецЕсли;
		Если СтрокаЗадания.Пользователь = ЭтаФорма.Пользователь Тогда
			Если СтрокаЗадания.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Ожидание Тогда
				ЕстьОжидающие = Истина;
			ИначеЕсли СтрокаЗадания.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Выполняется Тогда
				ЕстьВыполняющиеся = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОжидающие И НЕ ЕстьВыполняющиеся Тогда // оработка ситуации когда по той или иной причине умер мастер
		Обработки.МенеджерОтложенныхЗаданий.ЗапуститьМастерЗаданийФормированияБухгалтерскогоУчета(Объект.Организация, ЭтаФорма.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Элементы.ЗаданияОрганизация.Видимость = Истина;
	КонецЕсли;
	
	ЭтаФорма.ИсключатьЗакрытыеДоговоры = Истина;
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Пользователь = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущийПользователь");

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ЗаполнитьСписокВыбораВидПериода(
												Перечисления.ДоступныеПериодыОтчета.День,
												ЭтаФорма.Элементы.ВидПериода.СписокВыбора,
												ЭтаФорма.ВидПериода);
												
	ОбновитьЗаданияНаСервере();
												
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимОтбораПриИзменении(ЭтаФорма.Элементы.РежимОтбора);
	ВидПериодаПриИзменении(Неопределено);
	
	// Обновляем виды учета и заголовок, если они еще не обновлены
	ОбновитьВидимостьКолонокСчетовДУ();
	
	ПоказатьФормированиеУчета(Ложь);
	
	Для Каждого ТекСтрока Из ЭтаФорма.Задания Цикл
		Если ТекСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Выполняется")
			И ТекСтрока.Пользователь = ЭтаФорма.Пользователь Тогда
			
			ПоказатьФормированиеУчета(Истина);
			ПодключитьОбработчикОжидания("ОжиданиеЗавершенияФоновыхЗаданий", 5);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтаФорма.СчетаДоверительногоУправления.Количество() = 0 Тогда
	
		ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого ТекСтрока Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		
		ТекСтрока.Обрабатывать = Истина;
		Если ЭтаФорма.ФормироватьБухгалтерскийУчет И ТекСтрока.БухгалтерскийУчетДата >= Объект.НачалоПериода
			ИЛИ ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет И ТекСтрока.ЕдиныйБухгалтерскийУчетДата >=  Объект.НачалоПериода
			ИЛИ ЭтаФорма.ФормироватьНалоговыйУчет И ТекСтрока.НалоговыйУчетДата >= Объект.НачалоПериода Тогда
		
			ТекСтрока.Обрабатывать = Ложь;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого ТекСтрока Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		ТекСтрока.Обрабатывать = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПЕРИОД

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВидПериодаПриИзменении(Элемент, ВидПериода, Объект.НачалоПериода, Объект.КонецПериода, Период);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПереключитьТекущуюСтраницуВыбораПериода(ВидПериода, Элементы.ГруппаПоляВводаПериода);
	
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	ОбновитьВидимостьКолонокСчетовДУ();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаДеньПриИзменении(Элемент)
	
	Объект.КонецПериода = КонецДня(Объект.НачалоПериода);
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.КонецПериода);
	
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ВидПериода, Период, Объект.НачалоПериода, Объект.КонецПериода);
	
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ВидПериода, Период, Объект.НачалоПериода, Объект.КонецПериода);
		
	ОбновитьТекстЗаголовкаНаСервере(ЭтаФорма);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		ВидПериода, Период, Объект.НачалоПериода, Объект.КонецПериода);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ВидПериода, Период, Объект.НачалоПериода, Объект.КонецПериода);
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовкаНаСервере(Форма)

	Объект = Форма.Объект;
	
	ЗаголовокОтчета = "Формирование бух. учета " + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(Объект.НачалоПериода, Объект.КонецПериода);

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + Строка(Объект.Организация);
	КонецЕсли;

	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ОбновитьВидимостьКолонокСчетовДУ()

	Элементы.СчетаДоверительногоУправленияБухгалтерскийУчет.Видимость 			= Ложь;
	Элементы.СчетаДоверительногоУправленияБухгалтерскийУчетДата.Видимость 		= Ложь;
	
	Элементы.СчетаДоверительногоУправленияЕдиныйБухгалтерскийУчет.Видимость 	= Ложь;
	Элементы.СчетаДоверительногоУправленияЕдиныйБухгалтерскийУчетДата.Видимость = Ложь;
	
	Элементы.СчетаДоверительногоУправленияНалоговыйУчет.Видимость				= Ложь;
	Элементы.СчетаДоверительногоУправленияНалоговыйУчетДата.Видимость			= Ложь;
	
	Элементы.СчетаДоверительногоУправленияБухгалтерскийУчет.Видимость			= ЭтаФорма.ФормироватьБухгалтерскийУчет;
	Элементы.СчетаДоверительногоУправленияБухгалтерскийУчетДата.Видимость 		= ЭтаФорма.ФормироватьБухгалтерскийУчет;
	
	Элементы.СчетаДоверительногоУправленияЕдиныйБухгалтерскийУчет.Видимость		= ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет;
	Элементы.СчетаДоверительногоУправленияЕдиныйБухгалтерскийУчетДата.Видимость = ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет;
	
	Элементы.СчетаДоверительногоУправленияНалоговыйУчет.Видимость				= ЭтаФорма.ФормироватьНалоговыйУчет;
	Элементы.СчетаДоверительногоУправленияНалоговыйУчетДата.Видимость			= ЭтаФорма.ФормироватьНалоговыйУчет;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьФормированиеУчета(Показать)
	
	Элементы.ДекорацияДлительнаяОперация.Видимость = Показать;
	Элементы.ДекорацияНадписьДлительнаяОперация.Видимость = Показать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьИСписокСчетовУчета()
	
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере(Ложь);
	
КонецПроцедуры // ОбновитьВидимостьИСписокСчетовУчета()

&НаКлиенте
Процедура УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления()
	
	//Если ЭтаФорма.СчетаДоверительногоУправления.Количество() > 0 Тогда
	//	Если Вопрос("Таблица счетов доверительного управления будет перезаполнена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	ЗаполнитьСчетаДоверительногоУправленияПоВидамУчетаНаСервере();
	    	
КонецПроцедуры // УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления

#КонецОбласти

&НаКлиенте
Процедура ОжиданиеЗавершенияФоновыхЗаданий()
	
	КлючТекущейСтрокиРегламентныхЗаданий = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.Задания, "ИдентификаторФоновогоЗадания");
	
	ОбновитьЗаданияНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.Задания, Элементы.Задания, "ИдентификаторФоновогоЗадания", КлючТекущейСтрокиРегламентныхЗаданий);
		
	ОсталисьЗадания = Ложь;
	
	Для Каждого ТекСтрока Из ЭтаФорма.Задания Цикл
		
		Если ТекСтрока.Пользователь <> ЭтаФорма.Пользователь Тогда // чужие задания нам не интересны
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Выполняется")
			ИЛИ ТекСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Ожидание") Тогда
		
			ОсталисьЗадания = Истина;
		
		КонецЕсли;
		
		СтрокиСчетаДУ = ЭтаФорма.СчетаДоверительногоУправления.НайтиСтроки(Новый Структура("СчетДоверительногоУправления", ТекСтрока.СчетДоверительногоУправления));
		Для каждого СтрокаСчетаДУ Из СтрокиСчетаДУ Цикл
		
			Если ТекСтрока.ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.БухгалтерскийУчет") Тогда
				СтрокаСчетаДУ.БухгалтерскийУчетДата = ТекСтрока.ДатаЗапретаРедактирования;
			ИначеЕсли ТекСтрока.ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.НалоговыйУчет") Тогда
				СтрокаСчетаДУ.НалоговыйУчетДата = ТекСтрока.ДатаЗапретаРедактирования;
			ИначеЕсли ТекСтрока.ВидУчета = ПредопределенноеЗначение("Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет") Тогда
				СтрокаСчетаДУ.ЕдиныйБухгалтерскийУчетДата = ТекСтрока.ДатаЗапретаРедактирования;
			КонецЕсли;
			
			СтрокаСчетаДУ.Состояние = ТекСтрока.Состояние;
			
		КонецЦикла;
		
		Если ТекущаяДата() - ТекСтрока.ДатаЗавершения > 7 И ТекСтрока.ДатаЗавершения <> '00010101' Тогда // давно уже завершилось - можно про него не сообщать
			Продолжить;		
		КонецЕсли;
		
		Если ТекСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Ошибка") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон( "Формирование по '%1' завершено с ошибками!", ТекСтрока.СчетДоверительногоУправления));
		ИначеЕсли ТекСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Отменено") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон( "Формирование по '%1' отменено!", ТекСтрока.СчетДоверительногоУправления));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОсталисьЗадания Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьФормированиеУчета(Ложь);
	ОтключитьОбработчикОжидания("ОжиданиеЗавершенияФоновыхЗаданий");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка завершена");
			
КонецПроцедуры

&НаСервере
Функция ПроверитьДатыЗапрета(КоличествоСчетовКФормированию)
	
	МассивВидовУчета = Новый Массив();
	
	Если ЭтаФорма.ФормироватьБухгалтерскийУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.БухгалтерскийУчет);
	ИначеЕсли ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	ИначеЕсли ЭтаФорма.ФормироватьНалоговыйУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
	КонецЕсли;
	
	РезультатПроверки = Новый Структура("ЕстьСчетаСДатойЗапретаБольшеНачалаПериода, ЕстьСчетаСПромежуткомМеждуДатойЗапретаИНачаломПериода", Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДатыЗапретаРедактирования.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= &НачалоПериода КАК ДатаЗапретаБольше,
		|	ДатыЗапретаРедактирования.ДатаЗапретаРедактирования <> ДАТАВРЕМЯ(1, 1, 1)
		|		И РАЗНОСТЬДАТ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования, &НачалоПериода, ДЕНЬ) > 1 КАК ДатаЗапретаЕстьПромежуток
		|ИЗ
		|	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
		|ГДЕ
		|	ДатыЗапретаРедактирования.СчетДоверительногоУправления В(&СчетаДоверительногоУправления)
		|	И ДатыЗапретаРедактирования.ГруппаЗапрета = ЗНАЧЕНИЕ(Перечисление.ГруппыЗапретаРедактирования.Партии)
		|	И ДатыЗапретаРедактирования.ВидУчета В(&МассивВидовУчета)
		|	И (ДатыЗапретаРедактирования.ДатаЗапретаРедактирования >= &НачалоПериода
		|			ИЛИ ДатыЗапретаРедактирования.ДатаЗапретаРедактирования <> ДАТАВРЕМЯ(1, 1, 1)
		|				И РАЗНОСТЬДАТ(ДатыЗапретаРедактирования.ДатаЗапретаРедактирования, &НачалоПериода, ДЕНЬ) > 1)";
	
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", ЭтаФорма.СчетаДоверительногоУправления.Выгрузить().ВыгрузитьКолонку("СчетДоверительногоУправления"));
	Запрос.УстановитьПараметр("МассивВидовУчета", МассивВидовУчета);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокиНеОбрабатывать = ЭтаФорма.СчетаДоверительногоУправления.НайтиСтроки(Новый Структура("СчетДоверительногоУправления, Обрабатывать", Выборка.СчетДоверительногоУправления, Истина));
		Для каждого СтрокаНеОбрабатывать Из СтрокиНеОбрабатывать Цикл
			
			РезультатПроверки.ЕстьСчетаСДатойЗапретаБольшеНачалаПериода				= РезультатПроверки.ЕстьСчетаСДатойЗапретаБольшеНачалаПериода				ИЛИ Выборка.ДатаЗапретаБольше;
			РезультатПроверки.ЕстьСчетаСПромежуткомМеждуДатойЗапретаИНачаломПериода	= РезультатПроверки.ЕстьСчетаСПромежуткомМеждуДатойЗапретаИНачаломПериода	ИЛИ Выборка.ДатаЗапретаЕстьПромежуток;
			
			СтрокаНеОбрабатывать.Обрабатывать = Ложь;
			КоличествоСчетовКФормированию = КоличествоСчетовКФормированию - 1;
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Функция ПроверитьНастройкиУчета()

	КонтрольБУ = Ложь;
	КонтрольНУ = Ложь;
	КонтрольЕПС = Ложь;
	
	МассивСчетовДУ = Новый Массив;
	Для Каждого ТекСтрока Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		Если ТекСтрока.Обрабатывать Тогда
		    МассивСчетовДУ.Добавить(ТекСтрока.СчетДоверительногоУправления);
		КонецЕсли;
	КонецЦикла;
	
	ОтчетПроверкаНастроек = ОбщегоНазначения.ПолучитьИменованныйОбъект("ОтчетПроверкаНастроек");
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ОтчетПроверкаНастроек);
	
	ФормаОтчета = ПолучитьФорму("ВнешнийОтчет." + ИмяПодключенногоОбъекта + ".Форма", );
	
	ФормаОтчета.Период.ДатаНачала = Объект.НачалоПериода;
	ФормаОтчета.Период.ДатаОкончания = Объект.КонецПериода;

	ФормаОтчета.КонтрольБУ = ЭтаФорма.ФормироватьБухгалтерскийУчет;
	ФормаОтчета.КонтрольНУ = ЭтаФорма.ФормироватьНалоговыйУчет;
	ФормаОтчета.КонтрольЕПС = ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет;
	
	ФормаОтчета.СчетаДУ.ЗагрузитьЗначения(МассивСчетовДУ);

	Возврат ФормаОтчета.КонтрольИзФормированияУчета();
	
КонецФункции
 
&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	ТекстОшибки = "";
	Если Объект.НачалоПериода = '00010101' ИЛИ Объект.КонецПериода = '00010101' ИЛИ Объект.НачалоПериода > Объект.КонецПериода Тогда
		ТекстОшибки = "Неверно заполнен период! Формирование учета прервано";
	ИначеЕсли КонецДня(Объект.КонецПериода) > КонецДня(ТекущаяДата()) Тогда
		ТекстОшибки = "Период формирования включает будущие даты! Формирование учета прервано";
	ИначеЕсли НЕ (ЭтаФорма.ФормироватьБухгалтерскийУчет ИЛИ ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет ИЛИ ЭтаФорма.ФормироватьНалоговыйУчет) Тогда
		ТекстОшибки = "Не выбран ни один вид учета!";
	ИначеЕсли Не ПроверитьНастройкиУчета() Тогда
		ТекстОшибки = "Не заполнены настройки по некоторым счетам ДУ! Формирование учета прервано";
	КонецЕсли;
	
	Если ТекстОшибки <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	КоличествоСчетовКФормированию = 0;
	Для каждого СтрокаСчетаДоверительногоУправления Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		Если СтрокаСчетаДоверительногоУправления.Обрабатывать Тогда 
			КоличествоСчетовКФормированию = КоличествоСчетовКФормированию + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоСчетовКФормированию = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано счетов для формирования!");
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьДатыЗапрета(КоличествоСчетовКФормированию);
	Если РезультатПроверки.ЕстьСчетаСДатойЗапретаБольшеНачалаПериода ИЛИ РезультатПроверки.ЕстьСчетаСПромежуткомМеждуДатойЗапретаИНачаломПериода Тогда

		ТекстСообщения = "У счетов ДУ есть проблемы:";
		
		Если РезультатПроверки.ЕстьСчетаСДатойЗапретаБольшеНачалаПериода Тогда
			ТекстСообщения = ТекстСообщения + "
				| Даты запрета больше начала периода!"
		КонецЕсли;
		
		Если РезультатПроверки.ЕстьСчетаСПромежуткомМеждуДатойЗапретаИНачаломПериода Тогда
			ТекстСообщения = ТекстСообщения + "
				| Между датой запрета и началом периода промежуток больше одного дня!
				| Нужно или сдвинуть даты запрета или поставить начало периода со следующего дня после даты запрета";
		КонецЕсли;
		
		Если КоличествоСчетовКФормированию = 0 Тогда

			ТекстСообщения = ТекстСообщения + "
				| Формирование учета прервано";
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
				
		Иначе
			
			ТекстСообщения = ТекстСообщения + "
				| Сформировать учет по остальным?";
			
			Если Вопрос(ТекстСообщения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ПоказатьФормированиеУчета(Истина);
	
	ПодготовитьПараметрыОбработкиИНачатьВыполнениеНаСервере();
		
	ПодключитьОбработчикОжидания("ОжиданиеЗавершенияФоновыхЗаданий", 5);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПараметрыОбработкиИНачатьВыполнениеНаСервере()
	
	МассивВидовУчета = Новый Массив;
	Если ЭтаФорма.ФормироватьБухгалтерскийУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.БухгалтерскийУчет);
	КонецЕсли;
	Если ЭтаФорма.ФормироватьЕдиныйБухгалтерскийУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.ЕдиныйБухгалтерскийУчет);
	КонецЕсли;
	Если ЭтаФорма.ФормироватьНалоговыйУчет Тогда
		МассивВидовУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
	КонецЕсли;
	
	ПараметрыФормированияБухгалтерскогоУчета = Обработки.МенеджерОтложенныхЗаданий.ПолучитьПараметрыФормированияБухгалтерскогоУчета();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОбъектФормированияБухгалтерскогоУчета",	ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета);
	Запрос.УстановитьПараметр("КомандаФормированияБухгалтерскогоУчета",	ПараметрыФормированияБухгалтерскогоУчета.КомандаФормированияБухгалтерскогоУчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Организация КАК Организация,
		|	ОтложенныеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОтложенныеЗадания.ВидУчета КАК ВидУчета,
		|	ОтложенныеЗадания.Сложность КАК Сложность
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Объект = &ОбъектФормированияБухгалтерскогоУчета
		|	И ОтложенныеЗадания.Команда = &КомандаФормированияБухгалтерскогоУчета
		|	И ОтложенныеЗадания.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание), ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидУчета УБЫВ";
	
	ЗапущенныеФормирования = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСчетаДоверительногоУправления Из ЭтаФорма.СчетаДоверительногоУправления Цикл
		
		Если НЕ СтрокаСчетаДоверительногоУправления.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
		
		СчетДоверительногоУправления = СтрокаСчетаДоверительногоУправления.СчетДоверительногоУправления;
		
		Для каждого ВидУчета Из МассивВидовУчета Цикл
		
			ИмяВидаУчета = РаботаСМетаданнымиПовтИсп.ПолучитьИдентификаторПеречисления(ВидУчета);
			
			ТекстОшибки = "";
			Если НЕ СтрокаСчетаДоверительногоУправления[ИмяВидаУчета] Тогда
				ТекстОшибки = "По счету ДУ " + СчетДоверительногоУправления + " на " + Формат(Объект.НачалоПериода, "ДФ=dd.MM.yyyy") + " " + ВидУчета + "  не ведется - пропускаем";
			ИначеЕсли ЗапущенныеФормирования.НайтиСтроки(Новый Структура("СчетДоверительногоУправления, ВидУчета", СчетДоверительногоУправления, ВидУчета)).Количество() > 0 Тогда
				ТекстОшибки = "По счету ДУ " + СчетДоверительногоУправления + " уже запущено формирование " + ВидУчета + ", дождитесь его окончания";
			КонецЕсли;
			
			Если ТекстОшибки <> "" Тогда
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			СтрокаСчетаДоверительногоУправления.Обрабатывать = Ложь;
			
			ПараметрыОбработки = Новый Структура;
			
			ПараметрыОбработки.Вставить("СчетДоверительногоУправления",	СчетДоверительногоУправления);
			ПараметрыОбработки.Вставить("ВидУчета",						ВидУчета);
			ПараметрыОбработки.Вставить("НачалоПериода",				Объект.НачалоПериода);
			ПараметрыОбработки.Вставить("КонецПериода",					КонецДня(Объект.КонецПериода));
			ПараметрыОбработки.Вставить("Организация",					Объект.Организация);
			ПараметрыОбработки.Вставить("Сложность",					СтрокаСчетаДоверительногоУправления.ОбъемПортфеля);
			ПараметрыОбработки.Вставить("Пользователь",					ЭтаФорма.Пользователь);
			
			РаботаСРегламентнымиЗаданиями.ДобавитьОтложенноеЗадание(
											ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета,
											ПараметрыФормированияБухгалтерскогоУчета.КомандаФормированияБухгалтерскогоУчета,
											ПараметрыОбработки);
			
		КонецЦикла;
	
	КонецЦикла;
	
	Обработки.МенеджерОтложенныхЗаданий.ЗапуститьМастерЗаданийФормированияБухгалтерскогоУчета(Объект.Организация, ЭтаФорма.Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВидаОтбора(ИмяВидаОтбора)

	ИмяРеквизитаВидОтбора = "Отбор" + ИмяВидаОтбора + "ВСписке";
	ИмяЭлемента = "Отбор" + ИмяВидаОтбора;
	ИмяЭлементаСписок = "Отбор" + ИмяВидаОтбора + "Список";
	
	ВидОтбораВСписке = ЭтаФорма[ИмяРеквизитаВидОтбора];
	
	Элементы[ИмяЭлемента].Видимость = Не ВидОтбораВСписке;
	Элементы[ИмяЭлементаСписок].Видимость = ВидОтбораВСписке;
	
	Если Не ВидОтбораВСписке Тогда
		
		КоличествоЭлементов = ЭтаФорма[ИмяЭлемента].Количество();
		
		Если КоличествоЭлементов = 0 Тогда
			// добавим первую строку
			ЭтаФорма[ИмяЭлемента].Добавить();
		ИначеЕсли КоличествоЭлементов > 1 Тогда
			Для Индекс = -(КоличествоЭлементов - 1) По -1 Цикл
				// удалим все элементы, кроме первого
				ЭтаФорма[ИмяЭлемента].Удалить(-Индекс);
			КонецЦикла; 
		КонецЕсли; 
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	Элементы.ГруппаОтборВидыДоговоровДУ.Видимость 	= ЭтаФорма.РежимОтбора = 1;
	Элементы.ГруппаОтборСчетаДУ.Видимость 			= ЭтаФорма.РежимОтбора = 2;
	Элементы.ГруппаОтборКлиенты.Видимость 			= ЭтаФорма.РежимОтбора = 3;
	Элементы.ГруппаОтборСпецДеп.Видимость 				= ЭтаФорма.РежимОтбора = 4;
	
	ПриИзмененииВидаОтбора("ВидыДоговоровДУ");
	ПриИзмененииВидаОтбора("СчетаДУ");
	ПриИзмененииВидаОтбора("Клиенты");
	ПриИзмененииВидаОтбора("СпецДеп");
	
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУВСпискеПриИзменении(Элемент)
	ПриИзмененииВидаОтбора("ВидыДоговоровДУ");
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУВСпискеПриИзменении(Элемент)
	ПриИзмененииВидаОтбора("СчетаДУ");
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыВСпискеПриИзменении(Элемент)
	ПриИзмененииВидаОтбора("Клиенты");
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпецДепВСпискеПриИзменении(Элемент)
	ПриИзмененииВидаОтбора("СпецДеп");
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидыДоговоровДУСписокПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетаДУСписокПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпецДепПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборКлиентыСписокПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпецДепСписокПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура ИсключатьЗакрытыеДоговорыПриИзменении(Элемент)
	Элементы.ТолькоЗакрытыеДоговоры.Видимость = НЕ ЭтаФорма.ИсключатьЗакрытыеДоговоры;
	Если ЭтаФорма.ИсключатьЗакрытыеДоговоры Тогда
		ЭтаФорма.ТолькоЗакрытыеДоговоры = Ложь;
		Элементы.СчетаДоверительногоУправленияДатаРасторжения.Видимость = ЭтаФорма.ТолькоЗакрытыеДоговоры;
	КонецЕсли;
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаКлиенте
Процедура СчетаДоверительногоУправленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.СчетаДоверительногоУправления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СчетаДоверительногоУправленияСчетДоверительногоУправления" Тогда
		ТекущиеДанные = ЭтаФорма.Элементы.СчетаДоверительногоУправления.ТекущиеДанные;
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция КтоФормируетНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Организация КАК Организация,
		|	ОтложенныеЗадания.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОтложенныеЗадания.ВидУчета КАК ВидУчета,
		|	ОтложенныеЗадания.Состояние КАК Состояние,
		|	ОтложенныеЗадания.ДатаДобавления КАК ДатаДобавления,
		|	ОтложенныеЗадания.ДатаЗапуска КАК ДатаЗапуска,
		|	ОтложенныеЗадания.Пользователь КАК Пользователь,
		|	ОтложенныеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.СостоянияОтложенныхЗаданий.Ожидание))
		|	И ОтложенныеЗадания.Организация = &Организация
		|	И ОтложенныеЗадания.Объект = &ОбъектФормированияБухгалтерскогоУчета
		|	И ОтложенныеЗадания.Команда = &КомандаФормированияБухгалтерскогоУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДобавления";
	
	ПараметрыФормированияБухгалтерскогоУчета = Обработки.МенеджерОтложенныхЗаданий.ПолучитьПараметрыФормированияБухгалтерскогоУчета();	
	
	Запрос.УстановитьПараметр("ОбъектФормированияБухгалтерскогоУчета",			ПараметрыФормированияБухгалтерскогоУчета.ОбъектФормированияБухгалтерскогоУчета);
	Запрос.УстановитьПараметр("КомандаФормированияБухгалтерскогоУчета",			ПараметрыФормированияБухгалтерскогоУчета.КомандаФормированияБухгалтерскогоУчета);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЗаданий.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50)));
	
	Для каждого Задание Из ТаблицаЗаданий Цикл
	
		Если Задание.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Ожидание Тогда
			Задание.Статус = "Ожидает запуска";
		ИначеЕсли Задание.Пользователь = ЭтаФорма.Пользователь Тогда // свое фоновое можно посмотреть
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Задание.ИдентификаторФоновогоЗадания);
			Если ФоновоеЗадание = Неопределено Тогда
				Задание.Статус = "Ошибка: не смогло запуститься";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				Задание.Статус = "Выполняется";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				Задание.Статус = "Ошибка: завершено";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				Задание.Статус = "Ошибка: аварийное завершение";
			ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				Задание.Статус = "Ошибка: отменено";
			КонецЕсли;
		Иначе // а вот чужое фоновое нельзя - пишем просто выполняется
			Задание.Статус = "Выполняется";
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаЗаданий.Колонки.Удалить("ИдентификаторФоновогоЗадания");
	ТаблицаЗаданий.Колонки.Удалить("Состояние");
	
	ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент(, , , Новый ТабличныйДокумент); 

	РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ТаблицаЗаданий, , , , Истина); 
	РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
	
	Возврат ПараметрыВывода.ДокументРезультат;
	
КонецФункции

&НаКлиенте
Процедура КтоФормирует(Команда)
	
	Документ = КтоФормируетНаСервере();
	
	Документ.ТолькоПросмотр = Истина;
	Документ.ОтображатьСетку = Ложь;
	Документ.Показать("Текущие формирования");
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоЗакрытыеДоговорыПриИзменении(Элемент)
	Элементы.СчетаДоверительногоУправленияДатаРасторжения.Видимость = ЭтаФорма.ТолькоЗакрытыеДоговоры;
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
КонецПроцедуры

&НаСервере
Функция НайтиСессию(ИдентификаторФоновогоЗадания)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.Сессия КАК Сессия,
		|	СтатистикаРаботыВнутреннихМеханизмов.ПараметрыВыполнения КАК ПараметрыВыполнения
		|ИЗ
		|	РегистрСведений.СтатистикаРаботыВнутреннихМеханизмов КАК СтатистикаРаботыВнутреннихМеханизмов
		|ГДЕ
		|	СтатистикаРаботыВнутреннихМеханизмов.Механизм = &ИскомыйМеханизм
		|	И СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|	И СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияНачало >= &НачалоС
		|	И СтатистикаРаботыВнутреннихМеханизмов.ПериодВыполненияНачало <= &НачалоПо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВыполненияНачало";
	
	Запрос.УстановитьПараметр("НачалоС", НачалоДня(ТекущаяДата()) - 24 * 60 * 60);
	Запрос.УстановитьПараметр("НачалоПо", ТекущаяДата());
	Запрос.УстановитьПараметр("ИскомыйМеханизм", "Обработки.ФормированиеБухгалтерскогоУчета.ОбработатьСчетаДУФоново");
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		ПараметрыФормирования = ВыборкаДетальныеЗаписи.ПараметрыВыполнения.Получить();
		Если ПараметрыФормирования.ИдентификаторЗадания = ИдентификаторФоновогоЗадания Тогда
			Возврат ВыборкаДетальныеЗаписи.Сессия;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОтменитьФормированиеНаСервере(Идентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложенныеЗадания.Состояние КАК Состояние,
		|	ОтложенныеЗадания.ИдентификаторФоновогоЗадания КАК ИдентификаторФоновогоЗадания
		|ИЗ
		|	РегистрСведений.ОтложенныеЗадания КАК ОтложенныеЗадания
		|ГДЕ
		|	ОтложенныеЗадания.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Выполняется Тогда
			
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ВыборкаДетальныеЗаписи.ИдентификаторФоновогоЗадания);
			
			Если Задание <> Неопределено										// ФЗ существует (уже запускался)
				И Задание.Ключ <> Пользователь.Код								// это не ФЗ мастера-формирователя
				И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда	// ФЗ жив и работает
				
				Попытка
					Задание.Отменить();
				Исключение
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отменить формирование!");
					Возврат;
				КонецПопытки;
				
				ЗаписьЖурналаРегистрации("Фоновое задание. Ошибка выполнения", 
											УровеньЖурналаРегистрации.Ошибка, 
											Метаданные.Обработки.ФормированиеБухгалтерскогоУчета, 
											Задание.Наименование, 
											"Интерактивная отмена формирования учета");
				Сессия = НайтиСессию(ВыборкаДетальныеЗаписи.ИдентификаторФоновогоЗадания);
				Если Сессия <> Неопределено Тогда
					
					РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
						"Обработки.ФормированиеБухгалтерскогоУчета.ОбработатьСчетаДУФоново", 
						Сессия,
						,
						,
						"Интерактивная отмена формирования учета");
				
				КонецЕсли;
				
			Иначе // ФЗ уже нет - нужно просто отменить ОЗ
				РаботаСРегламентнымиЗаданиями.ОтменитьОтложенноеЗадание(Идентификатор, "Формирование отменено:" + ЭтаФорма.Пользователь, ЛОЖЬ);
			КонецЕсли;
										
		ИначеЕсли ВыборкаДетальныеЗаписи.Состояние = Перечисления.СостоянияОтложенныхЗаданий.Ожидание Тогда
			РаботаСРегламентнымиЗаданиями.ОтменитьОтложенноеЗадание(Идентификатор, "Формирование отменено:" + ЭтаФорма.Пользователь, ЛОЖЬ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Формирование уже отменено!");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДоступнаРольПолныеПраваНаСервере()

	Возврат РольДоступна("ПолныеПрава");

КонецФункции

&НаКлиенте
Процедура ОтменитьФормирование(Команда)
	
	ТекущиеДанные = ЭтаФорма.Элементы.Задания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите задание");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Выполняется")
		ИЛИ ТекущиеДанные.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияОтложенныхЗаданий.Ожидание") Тогда
		
		Если ТекущиеДанные.Пользователь <> ЭтаФорма.Пользователь И НЕ РаботаСПользователями.ЭтоПолноправныйПользователь(ЭтаФорма.Пользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отменить формирование можно только у своего задания");
			Возврат
		КонецЕсли;
		
		Если Вопрос("Вы уверены?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		ОтменитьФормированиеНаСервере(ТекущиеДанные.Идентификатор);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтчетОВыполненииНаСервере(ТекущиеДанные)

	СообщенияФоновогоЗадания = РаботаСДлительнымиОперациями.ПолучитьСообщения(ТекущиеДанные.ИдентификаторФоновогоЗадания);
	Сообщения = Новый Массив();
	
	Макет = Обработки.ФормированиеБухгалтерскогоУчета.ПолучитьМакет("МакетИнформацияОФормировании");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПараметрыФормирования = Макет.ПолучитьОбласть("ПараметрыФормирования");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьСообщения = Макет.ПолучитьОбласть("Сообщения");
	ОбластьСообщение = Макет.ПолучитьОбласть("Сообщение");
	
    Результат = Новый ТекстовыйДокумент();
	
	Результат.Вывести(ОбластьЗаголовок);
	
	ЗаполнитьЗначенияСвойств(ОбластьПараметрыФормирования.Параметры, ТекущиеДанные);
	
	ПараметрыФормирования = ТекущиеДанные.Параметры.Получить();
	ОбластьПараметрыФормирования.Параметры.НачалоПериода = ПараметрыФормирования.НачалоПериода;
	ОбластьПараметрыФормирования.Параметры.КонецПериода = ПараметрыФормирования.КонецПериода;
	
	Результат.Вывести(ОбластьПараметрыФормирования);
	Результат.Вывести(ОбластьШапка);
	
	ТекущееВремя = "";
	Для каждого СообщениеФоновогоЗадания Из СообщенияФоновогоЗадания Цикл
		Если Лев(СообщениеФоновогоЗадания, 2) = "# " Тогда
			Если Прав(СообщениеФоновогоЗадания, 25) <> "Начали формирование учета" Тогда
				
			    ОбластьСтрока.Параметры.День = Сред(СообщениеФоновогоЗадания, 30, 10);
				ОбластьСтрока.Параметры.Этап = Сред(СообщениеФоновогоЗадания, 43);
				ОбластьСтрока.Параметры.Начало = ТекущееВремя;
				ОбластьСтрока.Параметры.Конец = Сред(СообщениеФоновогоЗадания, 3, 8);
				
				Результат.Вывести(ОбластьСтрока);
				
			КонецЕсли;
			ТекущееВремя = Сред(СообщениеФоновогоЗадания, 3, 8);
		Иначе
			Сообщения.Добавить(СообщениеФоновогоЗадания);
		КонецЕсли;
	КонецЦикла;
	Результат.Вывести(ОбластьПодвал);
	
	Если Сообщения.Количество() > 0 Тогда
		Результат.Вывести(ОбластьСообщения);
		Для каждого Сообщение Из Сообщения Цикл
			ОбластьСообщение.Параметры.Сообщение = Сообщение;
			Результат.Вывести(ОбластьСообщение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = ЭтаФорма.Элементы.Задания.ТекущиеДанные;

	Если Поле.Имя = "ЗаданияСостояние" Тогда
		
		ДанныеФБУ = Новый Структура("ИдентификаторФоновогоЗадания, СчетДоверительногоУправления, ВидУчета, Пользователь, Организация, Состояние, Параметры");
		ЗаполнитьЗначенияСвойств(ДанныеФБУ, ТекущиеДанные);
		
		ПечатнаяФорма = ПолучитьОтчетОВыполненииНаСервере(ДанныеФБУ);
		ПечатнаяФорма.Показать("Отчет о формировании бухгалтерского учета");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьБухгалтерскийУчетПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ОбновитьВидимостьКолонокСчетовДУ();
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьНалоговыйУчетПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ОбновитьВидимостьКолонокСчетовДУ();
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьЕдиныйБухгалтерскийУчетПриИзменении(Элемент)
	УточнитьУПользователяИЗаполнитьСчетаДоверительногоУправления();
	ОбновитьВидимостьКолонокСчетовДУ();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьЗаданияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма, "Объект.Организация");
	
КонецПроцедуры
